#define _CRT_SECURE_NO_WARINGS 1

#include<stdio.h>

//int main()
//{
//	int a = 10;//4
//	float f = 10.0;//4
//
//	short a = 10;
//	short int b = 10;
//	return 0;
//}

//void test()
//{
//	printf("呵呵\n");
//}
//
//int main()
//{
//	test(100);
//	return 0;
//}

//int main()
//{
//	int a = 20;//4个字节-32bit
//	//00000000000000000000000000010100 - 原码
//	//00000000000000000000000000010100 - 反码
//	//00000000000000000000000000010100 - 补码
//	//0x00000014 - 16进制
//	int b = -10;
//	//10000000000000000000000000001010 - 原码
//	//11111111111111111111111111110101 - 反码
//	//1111 1111 1111 1111 1111 1111 1111 0110 - 补码
//	//0xFFFFFFF6 - 16进制
//}

//int check_sys()
//{
//	int a = 1;
//	char* p = (char*)&a;
//	//返回1，小端
//	//返回0，大端
//	return *p;
//}

//int check_sys()
//{
//	int a = 1;
//	return *(char*)&a;
//}
////指针类型的意义：
////1.指针类型决定了指针解引用操作符能访问几个字节：char *p;*p访问了一个字节，int *p;*p就访问了4个字节
////2.指针类型决定了指针+1，-1，到底加的或者减得是几个字节，跳过一个字符,int *;p+1跳过一个整型4个字节
//int main()
//{
//	//写一段代码告诉我们当前机器的字节序是什么
//	//从左向右 由低地址-->高地址
//	int ret = check_sys();
//	if (ret == 1)
//	{
//		printf("小端\n");
//	}
//	else
//	{
//		printf("大端\n");
//	}
//	return 0;
//}

//int main()
//{
//	char a = -1;
//	signed char b = -1;
//	unsigned char c = -1;
//	printf("a = %d,b = %d,c = %d", a, b, c);
//}

//int main()
//{
//	int i = -20;
//	unsigned int j = 10;
//	//10000000 00000000 00000000 00010100 - 原码
//	//11111111 11111111 11111111 11101011 - 反码
//	//11111111 11111111 11111111 11101100 - 补码
//	//00000000 00000000 00000000 00001010 - 补码
//	//11111111 11111111 11111111 11110110 - 结果
//	//11111111 11111111 11111111 11110101 
//	//10000000 00000000 00000000 00001010 - -10
//
//	printf("%d\n", i + j);
//	//按照补码的形式进行运算，最后格式化为有符号整数
//	return 0;
//}

int main()
{
	//(-1)^s * M     * 2^E
	//(-1)^s表示符号位，当s=0,V为整数；当s=1，V为负数
	//M表示有效数字，大于等于1，小于2
	//2^E表示指数位
	//9.0
	//1001.0
	//(-1)^0 * 1.001 * 2^3
	//(-1)^s * M     * 2^E
	//s - 0
	//M - 1.001
	//E - 3
	int n = 9;
	float* pFloat = (float*)&n;
	printf("n的值为%d\n", n);//9
	printf("*pFloat的值为：%f\n", *pFloat);//0.000000
	
	*pFloat = 9.0;
	printf("num的值为：%d\n", n);//1091567616
	printf("*pFloat的值为：%f\n", *pFloat);//9.000000
	return 0;
}